// -----------------独立测试区 1：函数声明提升1----------------------
// foo();
// function foo() 
// {
//     console.log(1);
// }


// -----------------独立测试区 2：函数声明提升2----------------------
// fof(); // 这样是错误的
// var fof = function () // 无论这里function有没有函数名,都一样
// {
//     console.log(1);
// }
// // fof();
// // // 仅仅是fof的声明提升,后续的函数不会提升,相当于:
// // var fof;
// // // fof();  // 这样是错误的
// // fof = function () 
// // {
// //     console.log(1);
// // }
// // fof();


// -----------------独立测试区 3：变量声明提升 与 函数声明提升 注意----------------------
// var a = 1;
// var a = 2;
// console.log(a);
// function b() 
// {
//     console.log(11);
// }
// function b() 
// {
//     console.log(22);
// }
// b();
// // 应该避免在同一作用域中重复声明。 - -！
